package chap01.variable;

public class Application {

    /*
    * 변수의 사용 목적
    * 1. 값에 의미를 부여하기 위한 목적
    * 2. 한 번 저장해둔 값을 재사용하기 위한 목적
    * 3. 변하는 값을 저장하고 사용할 수 있다.
    * */

    /*
    * 변수 사용 방법
    * 1. 변수를 준비한다. (선언)
    * 2. 변수에 값을 대입한다. (값 대입 및 초기화)
    * 3. 변수를 사용.
    * */

    /*
    * 자료형이란?
    * 다양한 값의 형태별로 어느 정도의 크기를 하나의 값으로 취급할 것인지
    * 미리 컴파일러와 약속한 키워드
    * 기본자료형, 참조자료형
    * */

    /*
    * 기본자료형
    * 정수를 취급하는 자료형 4가지
    * byte bnum;
    * short snum;
    * int inum;
    * long lnum;
    *
    * 실수를 취급하는 자료형 2가지
    * float fnum; 실수 뒤에 'f'를 붙여야 한다.
    * double dnum;
    *
    * 문자를 취급하는 자료형
    * char ch;
    * boolean isTrue;
    * */

    /*
    * 참조형 자료형
    * String str;
    * */

    /*
    * '=' 대입 연산자
    * 대입연산자의 왼편에는 공간이라는 의미가 있고, 오른편은 값이라는 의미가 있다.
    * */

    /*
    * 카멜케이스
    * 합성어일 경우 첫 단어는 모두 소문자, 두 번쨰 시작 단어는 대문자로 시작한다.
    * 자바에서는 클래스명만 유일하게 대문자로 시작한다.
    * */

}
